"""Доработать проект консольного приложения TODO -внести небольшие правки в код
Задачи следующие
1.Добавить в проект пункт ToReadItem, т.е то что нужно прочитать,у него должно быть два поля, заголовок
и URL.-что хотим прочитать -посмотреть models.py
2. Добавить команду "done" - логика которой помечать выполненые задачи(завершенные). см файл commands.py
логика, например вызываем done программа спрашивает какой элемент хотим пометить как выполненый
3. Любой член списка с done=True будет отмечаться в списке "+", а done=False отмечаться "-" см файл commands.py
4. А так же добавить команду undone -см файл commands.py

а так же смотрим файл main.py
"""